{
  "_name_or_path": "bert-base-multilingual-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "",
    "1": "CC",
    "2": "CCD",
    "3": "CCL",
    "4": "CCP",
    "5": "CCS",
    "6": "CCS_UT",
    "7": "CD",
    "8": "DM",
    "9": "DMD",
    "10": "DMQ",
    "11": "DMR",
    "12": "ECH",
    "13": "INTF",
    "14": "JJ",
    "15": "NEG",
    "16": "NN",
    "17": "NN)",
    "18": "NN,",
    "19": "NNP",
    "20": "NNV",
    "21": "NST",
    "22": "PR",
    "23": "PRC",
    "24": "PRF",
    "25": "PRL",
    "26": "PRP",
    "27": "PRQ",
    "28": "PSP",
    "29": "PUNC",
    "30": "PUNCF",
    "31": "PUNC\ue204\ue206",
    "32": "QTC",
    "33": "QTF",
    "34": "QTM",
    "35": "QTO",
    "36": "RB",
    "37": "RP",
    "38": "RPD",
    "39": "SYM",
    "40": "UNK",
    "41": "VAUX",
    "42": "VB",
    "43": "VBZ",
    "44": "VM",
    "45": "VNF",
    "46": "_INTF"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "": 0,
    "CC": 1,
    "CCD": 2,
    "CCL": 3,
    "CCP": 4,
    "CCS": 5,
    "CCS_UT": 6,
    "CD": 7,
    "DM": 8,
    "DMD": 9,
    "DMQ": 10,
    "DMR": 11,
    "ECH": 12,
    "INTF": 13,
    "JJ": 14,
    "NEG": 15,
    "NN": 16,
    "NN)": 17,
    "NN,": 18,
    "NNP": 19,
    "NNV": 20,
    "NST": 21,
    "PR": 22,
    "PRC": 23,
    "PRF": 24,
    "PRL": 25,
    "PRP": 26,
    "PRQ": 27,
    "PSP": 28,
    "PUNC": 29,
    "PUNCF": 30,
    "PUNC\ue204\ue206": 31,
    "QTC": 32,
    "QTF": 33,
    "QTM": 34,
    "QTO": 35,
    "RB": 36,
    "RP": 37,
    "RPD": 38,
    "SYM": 39,
    "UNK": 40,
    "VAUX": 41,
    "VB": 42,
    "VBZ": 43,
    "VM": 44,
    "VNF": 45,
    "_INTF": 46
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
